Revit 2027 API
ParameterMapIterator.Key Property
Retrieves the key that is the current focus of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual string Key { get; }
Public Overridable ReadOnly Property Key As String
	Get
public:
virtual property String^ Key {
	String^ get ();
}
abstract Key : string with get
override Key : string with get
Property Value
String
Remarks
 A new or Reset iterator must have MoveNext called on it before Current will return a valid key as per expected behavior of IEnumerator.
See Also
Reference
ParameterMapIterator Class
Autodesk.Revit.DB Namespace